Repository: pinard/Pynits
Catalog: *.po
Languages: fr

source: Many empty lines in a row.
fr: Plusieurs lignes vides d'affilée.

source: TAB within source.
fr: Tabulation dans le source.

source: Many spaces in a row.
fr: Plusieurs blancs d'affilée.

source: Trailing spaces.
fr: Blancs suffixes.

source: Line is too long.
fr: Ligne trop longue.

source: Questionnable formatting of triple quotes.
fr: Triple guillemets mal disposé.

source: In-line comment.
fr: Commentaire `en ligne'.

source: Space after opening symbol.
fr: Blanc après symbole ouvrant.

source: Space before closing symbol.
fr: Blanc avant symbole fermant.

source: Punctuation not followed by space.
fr: Ponctuation non-suivie d'un blanc.

source: Punctuation preceded by space.
fr: Ponctuation précédée d'un blanc.

source: Assignment or comparison symbol not preceded by space.
fr: Symbole d'affectation ou de comparaison non précédé d'un blanc.

source: Assignment or comparison symbol not followed by space.
fr: Symbole d'affectation ou de comparaison non suivi d'un blanc.

source: Escaped newline.
fr: Fin de ligne échappée.

source: Operator at end of line.
fr: Opérateur en fin de ligne.

source: Use of `import *' (detail what should be imported).
fr: Usage de l'énoncé `import *' (énumérer ce qu'il faut importer).

source: Use of `print' statement (maybe for debugging).
fr: Usage de l'énoncé `print' (peut-être pour mise-au-point).

source: Use of `apply' function (prefer `function(*arguments)').
fr: Usage de la fonction `apply' (utiliser `fonction(*arguments)').

source: Use of `close' method (maybe useless).
fr: Usage de la méthode `close' (peut-être inutile).

source: Use of `eval' function (rethink the algorithm).
fr: Usage de la fonction `eval' (repenser l'algorithme).

source: Use of `exec' statement (rethink the algorithm).
fr: Usage de l'énoncé `exec' (repenser l'algorithme).

source: Use of `execfile' function (rethink the algorithm).
fr: Usage de la fonction `execfile' (repenser l'algorithme).

source: Use of `find' method (maybe use `in').
fr: Usage de la méthode `find' (peut-être utiliser `in').

source: Use of `global' statement (use class variables).
fr: Usage de l'énoncé `global' (utiliser des variables de classe).

source: Use of `has_key' method (maybe use `in').
fr: Usage de la méthode `has_key' (peut-être utiliser `in').

source: Use of `input' function (rethink the algorithm).
fr: Usage de la fonction `input' (repenser l'algorithme).

source: Use of `keys' method (maybe useless).
fr: Usage de la méthode `keys' (peut-être inutile).

source: Use of `open' method (maybe use `file').
fr: Usage de la méthode `open' (peut-être utiliser `file').

source: Use of `readlines' method (maybe useless).
fr: Usage de la méthode `readlines' (peut-être inutile).

source: Use of `string' module (maybe string methods).
fr: Usage du module `string' (peut-être méthodes chaînes).

source: Use of `type' function (maybe use `isinstance').
fr: Usage de la fonction `type' (peut-être utiliser `isinstance').

source: Richard Nault's style date (use ISO-8601 notation).
fr: Date à la Richard Nault (utiliser la notation ISO-8601).

source: Syntax error, maybe did not back up enough.
fr: Erreur de syntaxe, peut-être recul insuffisant.

source: Spurious `%s'.
fr: `%s' intempestif.

source: `%s' seen, `%s' expected!
fr: `%s' vu, `%s' attendu!

source: `%s' expected!
fr: `%s' attendu!

source: No Python code!
fr: Pas de code Python!

source: Tracing disabled.
fr: Trace inactive.

source: Strategy per text region.
fr: Stratégies par région de texte.

source: Tracing choices between solutions.
fr: Trace des choix entre solutions.

source: Detailed trace, very verbose.
fr: Trace détaillée, très verbeuse.

source: Column
fr: Colonne

source: Line
fr: Ligne

source: Mixed
fr: Mixte

source: filled
fr: remplie

source: %d tries
fr: %d essais

source: one try
fr: un essai

source: no try
fr: aucun essai

source: , %d choices
fr: , %d choix

source: , one choice
fr: , un choix

source: , %d dead-ends
fr: , %d impasses

source: , one dead-end
fr: , une impasse

source: Text
fr: Texte

source: String too long
fr: Chaîne trop longue

source: WARNING: floating values are not dependable. (There is a bug in `import compiler'. Sigh!)
fr: ATTENTION: les valeurs flottantes ne sont pas fiables. (Il s'agit d'un bug dans `import compiler'. Misère!)

source: But how?!
fr: Comment faire?!

source: Try
fr: Essai

source: Save-%d
fr: Sauve-%d

source: After %
fr: Après %

source: Line overflow
fr: Débordement de ligne
